In [137]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns

In [139]:
df=pd.read_csv('mart_data.csv')

In [66]:
df.head()

   Customer ID   Age  Buying Price(S)  Gender  Unnamed: 4 Unnamed: 5
0      1612199  22.0           7.2500    Male         NaN        NaN
1      1612227  38.0          71.2833     NaN         NaN        NaN
2      1612211  26.0           7.9250  Female         NaN        NaN
3      1612198  35.0          53.1000     NaN         NaN        NaN
4      1612204  35.0           8.0500    Male         NaN        NaN

In [68]:
df_n=df.fillna('Male')

In [70]:
df_n['Gender'].isnull().sum()

0

In [72]:
df.sample(2)


df['Gender'].nunique()

2

In [74]:
from sklearn.preprocessing import OneHotEncoder

In [76]:
ohe = OneHotEncoder(sparse_output=False,handle_unknown='ignore',drop='first').set_output(transform='pandas')
df_n_n = ohe.fit_transform(df_n[['Gender']])

In [84]:
pd.concat([df_n_n,df_n.drop(columns=['Gender','Unnamed: 4','Unnamed: 5'])],axis=1)

     Gender_Male  Customer ID   Age Buying Price(S)
0            1.0      1612199  22.0            7.25
1            1.0      1612227  38.0         71.2833
2            0.0      1612211  26.0           7.925
3            1.0      1612198  35.0            53.1
4            1.0      1612204  35.0            8.05
..           ...          ...   ...             ...
886          1.0      1612222  27.0            13.0
887          1.0      1612224  19.0            30.0
888          1.0      1612223  Male           23.45
889          1.0      1612227  26.0            Male
890          1.0      1612218  32.0            7.75

[891 rows x 4 columns]

In [86]:
# Missing Data

In [92]:
df.head()

   Customer ID   Age  Buying Price(S)  Gender  Unnamed: 4 Unnamed: 5
0      1612199  22.0           7.2500    Male         NaN        NaN
1      1612227  38.0          71.2833     NaN         NaN        NaN
2      1612211  26.0           7.9250  Female         NaN        NaN
3      1612198  35.0          53.1000     NaN         NaN        NaN
4      1612204  35.0           8.0500    Male         NaN        NaN

In [94]:
df.isnull().sum()

Customer ID          0
Age                177
Buying Price(S)     45
Gender              19
Unnamed: 4         891
Unnamed: 5         890
dtype: int64

In [141]:
df= df.drop(columns=["Unnamed: 4","Unnamed: 5"])

In [100]:
df.isnull().sum()

Customer ID          0
Age                177
Buying Price(S)     45
Gender              19
dtype: int64

In [129]:
df.isnull().mean() *100

Customer ID         0.000000
Age                19.865320
Buying Price(S)     5.050505
Gender              2.132435
dtype: float64

In [143]:
df['Customer ID'] = df['Customer ID'].astype(object)

In [145]:
rem_col = []
for x in df.columns:
    if df[x].isnull().mean() <= 0.06 and df[x].isnull().mean() >=0 :
        rem_col.append(x)
print(rem_col)

['Customer ID', 'Buying Price(S)', 'Gender']

In [151]:
df_na = df.dropna(subset=rem_col)

In [165]:
from sklearn.impute import SimpleImputer
si = SimpleImputer(strategy='mean')
pd.DataFrame(si.fit_transform(df[['Buying Price(S)']]),columns=['Buying Price(S)_mean']).isnull().sum()

Buying Price(S)_mean    0
dtype: int64

In [171]:
si = SimpleImputer(strategy='median')
pd.DataFrame(si.fit_transform(df[['Buying Price(S)']]),columns=['Buying Price(S)_median'])

     Buying Price(S)_median
0                    7.2500
1                   71.2833
2                    7.9250
3                   53.1000
4                    8.0500
..                      ...
886                 13.0000
887                 30.0000
888                 23.4500
889                 14.4542
890                  7.7500

[891 rows x 1 columns]

In [173]:
df['Buying Price(S)'].fillna(10)

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    10.0000
890     7.7500
Name: Buying Price(S), Length: 891, dtype: float64

In [177]:
si = SimpleImputer(strategy='most_frequent')
pd.DataFrame(si.fit_transform(df[['Gender']]),columns=['Gender_Mode']).isnull().sum()

Gender_Mode    0
dtype: int64

In [179]:
df['Gender'].fillna('Missing')

0         Male
1      Missing
2       Female
3      Missing
4         Male
        ...
886       Male
887       Male
888       Male
889       Male
890       Male
Name: Gender, Length: 891, dtype: object